# DataFrame

In [1]:
import pandas as pd

In [2]:
data = {"calories":[420,30,390], "Duration":[50,40,45]}

In [3]:
# Load data into a dataframe object
df = pd.DataFrame(data)
print(df)

   calories  Duration
0       420        50
1        30        40
2       390        45

In [4]:
df

   calories  Duration
0       420        50
1        30        40
2       390        45

In [5]:
# Create empty dataframe
emp_df = pd.DataFrame()
print(emp_df)

Empty DataFrame
Columns: []
Index: []

In [6]:
# Create dataframe using list
list = ['a','b','c','d']
print(list)

['a', 'b', 'c', 'd']

In [8]:
list_df = pd.DataFrame(list)
list_df

   0
0  a
1  b
2  c
3  d

In [13]:
# Create dataframe using list of list
lst_of_lst = [['a','b','c'],[1,2,3],['d','e','f']]
lst_of_lst_df = pd.DataFrame(lst_of_lst)
lst_of_lst_df

   0  1  2
0  a  b  c
1  1  2  3
2  d  e  f

In [14]:
# Create dataframe using dictionary
dict = {'ID':[11,22,33,44], 'Name':['Ashif','Atul','Suman','Raj']}
dict_df = pd.DataFrame(dict)
dict_df

   ID   Name
0  11  Ashif
1  22   Atul
2  33  Suman
3  44    Raj

In [15]:
# Create dataframe using list of dictionary
lst_of_dict = [{'a':1, 'b':2}, {'a':3, 'b':4}]
lst_of_dict_df = pd.DataFrame(lst_of_dict)
lst_of_dict_df

   a  b
0  1  2
1  3  4

In [16]:
# Create dataframe using missing value
lst_of_dict = [{'a':1, 'b':2}, {'a':3, 'b':4, 'c':5}]
lst_of_dict_df = pd.DataFrame(lst_of_dict)
lst_of_dict_df

   a  b    c
0  1  2  NaN
1  3  4  5.0